# for 문 연습장
print("for 문 연습을 해보자")
print("for 문은 범위를 기준으로 횟수가 지정")
print()

#=============================================
print("#=========================================")
print("for 문 맛보기")
for i in range(0, 3): # 0~ 2까지 0,1,2  # range 의 사전적 의미 = 범위
    print(i)
#=============================================
print("#=========================================")
print()

# 신기한점 asdf 출력되고 끝날줄 알았는데 인덱스 하나하나 되나보다.
print("asdf 출력되고 끝날줄 알았는데 인덱스 하나하나 된다..")
for i in 'asdf':
    print(i, end=',')
print()
#=============================================
print("#=========================================")
print()

print("1~100 홀수 출력")
for i in range(1, 101):
    if i%2 != 0:
        print(i, end=",")
    i+=1

#=============================================
print("#=========================================")
print()


print("range 는 범위 지정도 가능하다 (1, 101, 2) 처럼")
print("이렇게 하면 홀수 출력이 더 간결해 진다.")
for i in range(1, 101, 2):
    print(i, end=',')


#=============================================
print("#=========================================")
print()

print("1~100 의 합")
s=0
for i in range(1, 101):
    s+=i
print("1~100 까지의 합은 :", s)

#=============================================
print("#=========================================")
print()

print("### 을 2줄 해보자")
for i in range(1,3): # 줄 관련
    for j in range(1,4):
        print("#", end="")
        print()
'''
2중 for 문 이해 
a 1~3 번, b 1~3 번이면
a 1 번 돌때 b 는 1,2,3 돌고 다음
a 2 번 b는 1,2,3 다음
a 3 번 b는 1,2,3 
a 라는 한 구멍으로 들어갔다가 3갈래길로 나간다.
'''

#=============================================
print("#=========================================")
print("삼각형 만들기")

for i in range(1,6):
    for j in range(1,i+1):
        print("*", end="")
    print()

#=============================================
print("#=========================================")
print("역삼각형 만들기")

for i in range(1, 6):  # 5번 반복
    ch=' '             # ch 에 ' ' 공백 입력
    for j in range(5, 0, -1): # 5 부터 0 까지 -1 역순
        if j==i: # j 가 작아지다가 i 와 값이 같아지면
            ch='*' # ch 에 * 입력
        print(ch, end='') # 그리고 * 입력하고 end''
    print() # 엔터

#=============================================
print("#=========================================")
print("구구단 한단")

dan = int(input('단수를 입력하라'))
for i in range(1, 10):
    print(dan, ' * ', i, ' = ', dan*i)

#=============================================
print("#=========================================")
print("구구단 세로 출력")

for i in range(2, 10):
    for j in range(1, 10):
        print(i, ' * ', j, ' = ', i*j)

#=============================================
print("#=========================================")
print("구구단 가로 출력")
for i in range(0, 10):
    for j in range(2, 10):
        if i==0:
            print(j, '단', end='\t\t')
        else:
            print(j, '*', i, '=', j*i,  end='\t')

    print()


#=============================================
print("#=========================================")
print("continue")
for i in range(1, 101):
    if i%2==0:
        continue
    print(i, end=',')